## Plan for org_account/spend_notifier
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 8 to add, 0 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.daily_budget_spend must be replaced
-/+ resource "aws_cloudwatch_event_rule" "daily_budget_spend" {
      ~ arn                 = "arn:aws:events:ca-central-1:659087519042:rule/daily_budget_spend" -> (known after apply)
      ~ id                  = "daily_budget_spend" -> (known after apply)
      ~ name                = "daily_budget_spend" -> "dailyBudgetSpend" # forces replacement
      + name_prefix         = (known after apply)
        tags                = {
            "CostCentre" = "cds-aws-lz-production"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_rule.weekly_budget_spend must be replaced
-/+ resource "aws_cloudwatch_event_rule" "weekly_budget_spend" {
      ~ arn                 = "arn:aws:events:ca-central-1:659087519042:rule/weekly_budget_spend" -> (known after apply)
      ~ id                  = "weekly_budget_spend" -> (known after apply)
      ~ name                = "weekly_budget_spend" -> "weeklyBudgetSpend" # forces replacement
      + name_prefix         = (known after apply)
        tags                = {
            "CostCentre" = "cds-aws-lz-production"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_event_target.daily_budget_spend will be created
  + resource "aws_cloudwatch_event_target" "daily_budget_spend" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = (sensitive)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_event_target.weekly_budget_spend will be created
  + resource "aws_cloudwatch_event_target" "weekly_budget_spend" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + input          = (sensitive)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # aws_iam_role.spend_notifier will be created
  + resource "aws_iam_role" "spend_notifier" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "spend_notifier_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.org_read_only will be created
  + resource "aws_iam_role_policy_attachment" "org_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AWSOrganizationsReadOnlyAccess"
      + role       = "spend_notifier_lambda"
    }

  # aws_iam_role_policy_attachment.spend_notifier will be created
  + resource "aws_iam_role_policy_attachment" "spend_notifier" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::659087519042:policy/spend_notifier"
      + role       = "spend_notifier_lambda"
    }

  # aws_lambda_function.spend_notifier will be created
  + resource "aws_lambda_function" "spend_notifier" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "/tmp/main.py.zip"
      + function_name                  = "spend_notifier"
      + handler                        = "app.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = 0
      + role                           = (known after apply)
      + runtime                        = "nodejs16.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = "1y+W5VLcB9MHa+x2eLh0M0L532xbTJ35HrXPBbNZsGs="
      + source_code_size               = (known after apply)
      + tags                           = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + ephemeral_storage {
          + size = (known after apply)
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

Plan: 8 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
